---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.#ctor(Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings)
source: html/73e92b11-d12b-4806-cba4-493e2af7cb84.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.#ctor Method

Constructs a new copy of the input AnalysisDisplayDiagramSettings object.

## Syntax (C#)
```csharp
public AnalysisDisplayDiagramSettings(
	AnalysisDisplayDiagramSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null